{"pages":[{"url":"debza/about","text":"I love software design, architectures, methodologies. Linkedin Twitter Github","tags":"pages","loc":"debza/about","title":"Samira Ouaaz"},{"url":"debza/blog/Choosing a password.html","text":"I was reading Schneier post about security and was reminded of the efforts we put in password remembering. It is worth to have a look at the advice given by XKCD XKCD Password Stregth How to protect yourself from this attack is pretty obvious. First, don't choose a guessable password. This is more than not using \"password1\" or \"qwerty\"; Most easily memorizable passwords are guessable. My advice is to generate passwords you have to remember by using either the XKCD scheme or the Schneier scheme, and to use large random passwords stored in a password manager for everything else.","tags":"Blog","loc":"debza/blog/Choosing a password.html","title":"Choosing a password"},{"url":"debza/blog/Django Resources.html","text":"A curated list of awesome Django apps, projects and resources = Awesome Django Django Packages is a directory of reusable apps, sites, tools, and more for your Django projects","tags":"Blog","loc":"debza/blog/Django Resources.html","title":"Django Resources"},{"url":"debza/blog/Install Pelican on GitHub.html","text":"Check this reference for more details Your generated site must be on the master branch to be hosted on Github Pages. This means that most of the code will need to live in a different branch. The master branch will get nuked at every deploy so don't store any files in the master branch. Generate the site using your production settings: pelican content -o output -s publishconf.py To get published, replace the contents of the master branch with the contents of the output directory. Run pip install ghp - import to install the utility that will make this easy. Then from the source branch run: ghp - import - b master output This will have the effect of removing all the contents of master, then copying the contents of output/ to master. The last step will be to push this changes to Github: git push origin master Hopefully you now have a basic site running.","tags":"Blog","loc":"debza/blog/Install Pelican on GitHub.html","title":"Install Pelican on GitHub"}]}